In [1]:
import pandas as pd
titanic = pd.read_csv("C://Users//wkdal//Desktop//archive//titanic.csv")

In [2]:
# 모든 행에 같은 값을 넣고 싶을 때

titanic['name_new'] = 'minji jang'
titanic['age_new'] = 30
titanic['Driver_new'] = True

titanic.head(3)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest,name_new,age_new,Driver_new
0,1.0,1.0,"Allen, Miss. Elisabeth Walton",female,29.0000,0.0,0.0,24160,211.3375,B5,S,2,NaN,"St Louis, MO",minji jang,30,True
1,1.0,1.0,"Allison, Master. Hudson Trevor",male,0.9167,1.0,2.0,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON",minji jang,30,True
2,1.0,0.0,"Allison, Miss. Helen Loraine",female,2.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON",minji jang,30,True